-- Даны типовые аннотации функций. Попытайтесь догадаться, что они делают,
-- дайте разумные имена и напишите их рекурсивные реализации (если вы
-- можете предложить несколько вариантов, реализуйте все):
-- 1) [a] -> Int -> a


-- 2) Eq a => [a] -> a -> Bool


-- 3) [a] -> Int -> [a]


-- 4) a -> Int -> [a]


-- 5) [a] -> [a] -> [a]


-- 6) (Eq a, Ord a) => [a] -> [[a]]


-- 7) [a] -> [(Int, a)]


-- 8) Eq a => [a] -> [a]


-- 9) (a -> Bool) -> [a] -> a


-- 10) (a -> a) -> (a -> Bool) -> [a] -> [a]
