{-
   Явная рекурсия в решениях хотя и допускается, но не приветствуется.
   Старайтесь обходиться стандартными функциями, используя при этом создание
   функций «на лету». Пытайтесь максимально упростить уже написанные
   решения, применяя подходящие функции из модуля Data.List и любых
   других модулей. Перед выполнением заданий изучите примеры из лекций.
-}

import Data.List

-- 1) Написать функцию, которая возвращает сумму первого и последнего элементов списка,
--    если список непуст, и 0 в противном случае.

-- f1 :: ???
f1 = undefined

-- 2) Написать функцию, которая возвращает длину числового  списка, если в нём имеется
--    нулевой элемент, и -1 в противном случае.

-- f2 :: ???
f2 = undefined

-- 3) Реализовать аналог функции replicate, воспользовавшись функциями repeat и take.
--    Рекомендация: постарайтесь воспользоваться операцией композиции.

replicate' :: Int -> a -> [a]
replicate' = undefined

-- 4) Посчитать количество слов в заданном предложении.
--    Рекомендация: постарайтесь воспользоваться операцией композиции.

ws :: String -> Int
ws = undefined

test_ws = ws "The quick brown fox jumps over the lazy dog" == 9

{-
  5) Преобразовать данный список целых чисел следующим образом:
     a) увеличить все его элементы в два раза;
     b) увеличить все его элементы с четными значениями в два раза;
     c) обнулить все его элементы с нечетными значениями.

  Каждая функция должна быть реализована несколькими способами
  с использованием именованной функции, анонимной функции и сечений:
-}

f5a_1 = map f
  where
    f = undefined

f5a_2 = map (\x -> undefined)

f5a_3 = map (undefined)

f5b_1 = map f
  where
    f = undefined

f5b_2 = map (\x -> undefined)

f5c_1 = map f
  where
    f = undefined

f5c_2 = map (\x -> undefined)

-- 6) Удалить из целочисленного списка все элементы,
--    превосходящие заданное целое число k.

f6_1 :: Integer -> [Integer] -> [Integer]
f6_1 k = filter f
 where
   f = undefined

f6_2 :: Integer -> [Integer] -> [Integer]
f6_2 k = filter (\x -> undefined)

f6_3 :: Integer -> [Integer] -> [Integer]
f6_3 k = filter (undefined)

-- 7) Найти сумму и произведение элементов числового списка.

sumprod :: Num a => [a] -> (a, a)
sumprod = foldl step (0, 1)
  where
    step = undefined

-- 8) Сформировать список, содержащий каждый второй элемент исходного.
every2nd :: [a] -> [a]
every2nd = fst . foldl step ([], False)
  where
    step = undefined

test_every2nd = every2nd [1,2,3,4,5] == [2,4] && every2nd [5, 10] == [10]

-- 9) Проверить, является ли заданное целое число простым.
isPrime n = foldl check True [2..n `div` 2]
  where
    check acc x = undefined

test_isPrime = isPrime 547 && isPrime 7927 && (not $ isPrime 4131)
